def main():
    a,k = map(int,input().split())
    cnt = 0
    while k != a:
        if k % 2 == 0 and k //2 >= a:
            k //=2
        else:
            k -=1
        cnt+=1
    print(cnt)


if __name__ == "__main__":
    main()

'''

입력으로 양의 정수 A와 K가 주어지면,
아래 연산을 이용하여 A를 K로 변경하려고 한다.
정수 A를 변경할 때 사용할 수 있는 연산 종류는 다음과 같다.
연산 1: 정수 A에 1을 더한다.
연산 2: 정수 A에 2를 곱한다.
정수 A를 정수 K로 만들기 위해 필요한 최소 연산 횟수를 출력하자.

입력
첫 번째 줄에 양의 정수 A와 K가 빈칸을 사이에 두고 순서대로 주어진다.

출력
첫 번째 줄에 양의 정수 A를 양의 정수 K로 만들기 위해 필요한 최소 연산 횟수를 출력한다.

제한
1 ≤ A < K ≤ 1,000,000

예제 입력 1 
5 10

예제 출력 1 
1

5(A), 10(연산 2)가 최소 연산이므로 정답은 1이다.

예제 입력 2 
7 77

예제 출력 2 
7

7(A),
8(연산 1),
9(연산 1),
18(연산 2),
19(연산 1),
38(연산 2),
76(연산 2),
77(연산 1)이 최소 연산이므로 정답은 7이다.

예제 입력 3 
1111 997651

예제 출력 3 
850

'''